driver-tests/bpelse/systemicqualities/Redelivery/RedirectOnFailureJBI/test/redirectTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:red="http://j2ee.netbeans.org/wsdl/RedirectOnFailure">
  <soapenv:Body>
    <red:msgElem>
      <id>101</id>
      <val>Sending Test Msg in Driver:</val>
    </red:msgElem>
  </soapenv:Body>
</soapenv:Envelope>